<html>
<!-- Mirrored from gyires.inf.unideb.hu/KMITT/c02/ch01s02.html by HTTrack Website Copier/3.x [XR&CO'2014], Fri, 27 Jan 2023 20:33:42 GMT -->
<head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>1.2. Történelem: a szoftver technológia kialakulása és fejl&#337;dése</title><link rel="stylesheet" href="style.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.75.2"><link rel="home" href="index.html" title="Szoftverfejlesztés"><link rel="up" href="ch01.html" title="1. fejezet - Bevezetés"><link rel="prev" href="ch01.html" title="1. fejezet - Bevezetés"><link rel="next" href="ch01s03.html" title="1.3. A szoftver fogalma, sajátosságai"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">1.2. 
            
            Történelem: a szoftver technológia kialakulása
            és fejl&#337;dése</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch01.html">El&#337;z&#337;</a>&nbsp;</td><th width="60%" align="center">1. fejezet - Bevezetés</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="ch01s03.html">Következ&#337;</a></td></tr></table><hr></div><div class="sect1" title="1.2. Történelem: a szoftver technológia kialakulása és fejl&#337;dése"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e115"></a>1.2. 
            
            <a name="__RefHeading__9_120998265"></a>Történelem: a szoftver technológia kialakulása
            és fejl&#337;dése</h2></div></div></div><p>A szoftver fejlesztés történetében az 1960-as évekig nyúlunk vissza. Ebben az
            id&#337;szakban már léteztek olyan számítógépek, amelyekkel nem csak tudományos kutatások és
            katonai alkalmazások igényeit lehetett kielégíteni, hanem a gyakorlatban felmerül&#337;
            problémákat is meg lehetett segítségükkel oldani. A programokat speciális tudású kutatók
            készítették, akik eredeti szakmájuk (tipikusan villamosmérnök vagy matematikus) mellett
            képezték át magukat. A programok készítése lényegében a processzor instrukciókészletét
            leképez&#337; assembly nyelven történt. Minden program egyedi darab volt, és er&#337;sen köt&#337;dött
            ahhoz a számítógép modellhez, amire készült. </p><p>A 60-as évek végén következett be a kés&#337;bbiekben &#8222;szoftver-krízis&#8221;-nek nevezett
            probléma. A hardver fejlesztések eredményeként megjelentek az úgynevezett harmadik
            generációs számítógépek, az el&#337;z&#337; modellekhez képest lényegesen hatékonyabban
            er&#337;forrásokat nyújtva. Ezzel olyan problémák megoldására is alkalmassá váltak, amelyek
            egy nagyobb és bonyolultabb programok írását tették szükségessé. A korábban használt
            eszközök azonban erre egyre alkalmatlanabbnak bizonyultak. A növekv&#337; fejlesztési
            igényeket nem lehetett id&#337;ben kielégíteni, így a csökken&#337; hardver árakkal szemben egyre
            növekv&#337; szoftver költségek jelentkeztek, az elkészült programok pedig nem megfelel&#337;
            min&#337;ség&#369;ek lettek.</p><p>1968-ban ennek a problémának az elemzésére tartottak az érintett szakemberek egy
            konferenciát. Ekkor jelent meg el&#337;ször a &#8222;szoftvertervezés&#8221; fogalma. A konferencia
            legfontosabb megállapításai a következ&#337;k voltak:</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>hatékonyabb programozási eszközök szükségesek,</p></li><li class="listitem"><p>a szoftverek fejlesztésére valamilyen módszeres megközelítést kell
                  kifejleszteni az eddigi ad-hoc munkamódszerek mellett.</p></li></ol></div><p>A szoftver technológia kialakulását ett&#337;l az id&#337;szaktól számíthatjuk, és fejl&#337;dését
            azóta is az határozza meg, hogy ez el&#337;bbi két kérdésre milyen választ tudunk
            adni.</p><p>Az 1970-es évek eredményei nagy vonalakban:</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>az els&#337; úgynevezett magas szint&#369; programozási nyelvek (Algol, Fortran, Cobol)
                  kialakulása,</p></li><li class="listitem"><p>a programozói munka szakmává válása, a csoportmunka igényének
                  megjelenése,</p></li><li class="listitem"><p>az algoritmusok és adatszerkezetek terén folyó kutatások,</p></li><li class="listitem"><p>a legels&#337; rendszeres programozási módszerek (strukturált, majd moduláris
                  programozás) kidolgozása.</p></li></ol></div><p>Az 1980-as évek legfontosabb eseményei:</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>a számítógépek teljesítményének növekedése és sorozatgyártásuk megindulása
                  egyre több szervezet számára tette lehet&#337;vé alkalmazásukat a mindennapi m&#369;ködésük
                  során.</p></li><li class="listitem"><p>Megjelentek az interaktivitást lehet&#337;vé tev&#337; perifériák (terminálok)</p></li><li class="listitem"><p>Kialakultak az els&#337; számítógépes hálózatok</p></li><li class="listitem"><p>Nagy mennyiség&#369; adatok változatos módon történ&#337; felhasználása vált szükségessé
                  &#8211; megjelent az adatbázis fogalma</p></li><li class="listitem"><p>Strukturált programozás nyelvek használata (C, PASCAL)</p></li><li class="listitem"><p>és egy újdonság, ami kés&#337;bb nagy jelent&#337;ség&#369; lesz: 1981-ben jelent meg az els&#337;
                  PC.</p></li></ol></div><p>Ezek az események nyilvánvalóvá tették, hogy a szoftver el&#337;állítása mérnöki
            tevékenység, és méretei, bonyolultsága miatt csak csoportmunkában végezhet&#337;. Kialakultak
            a kezdeti (funkcionális szemlélet&#369;) módszertanok, a hatékonyabb munkát lehet&#337;vé tev&#337;
            integrált fejleszt&#337; környezetek és a kora CASE (Computer Aided Software Engineering)
            rendszerek.</p><p>Az 1990-es évekt&#337;l a fejl&#337;dés minden területen felgyorsult. A hálózati technológiák
            rohamos terjedése (az Internet kialakulása) és a PC kategória tömegessé válása
            fokozatosan a vállalatok mellett a magánemberek számára is lehet&#337;vé tette a számítógépek
            használatát. Tovább bonyolítja a helyzetet a számítógépes, telekommunikációs és
            m&#369;sorszolgáltató hálózatok folyamatos közeledés és összefonódása. Erre a robbanásszer&#369;
            fejl&#337;désre az objektum orientált technológiák, a komponens szemlélet, a szabványok
            kialakulása és alkalmazása, egyre összetettebb fejleszt&#337; környezetek és a szoftver
            technológia mérnöki szemlélet&#369; módszerei próbálnak választ adni.</p><p></p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="ch01.html">El&#337;z&#337;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="ch01.html">Fel</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="ch01s03.html">Következ&#337;</a></td></tr><tr><td width="40%" align="left" valign="top">1. fejezet - Bevezetés&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Tartalom</a></td><td width="40%" align="right" valign="top">&nbsp;1.3. 
            
            A szoftver fogalma, sajátosságai</td></tr></table></div></body>
<!-- Mirrored from gyires.inf.unideb.hu/KMITT/c02/ch01s02.html by HTTrack Website Copier/3.x [XR&CO'2014], Fri, 27 Jan 2023 20:33:42 GMT -->
</html>