<html>
<!-- Mirrored from gyires.inf.unideb.hu/KMITT/c02/ch01.html by HTTrack Website Copier/3.x [XR&CO'2014], Fri, 27 Jan 2023 20:33:42 GMT -->
<head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>1. fejezet - Bevezetés</title><link rel="stylesheet" href="style.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.75.2"><link rel="home" href="index.html" title="Szoftverfejlesztés"><link rel="up" href="index.html" title="Szoftverfejlesztés"><link rel="prev" href="index.html" title="Szoftverfejlesztés"><link rel="next" href="ch01s02.html" title="1.2. Történelem: a szoftver technológia kialakulása és fejl&#337;dése"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">1. fejezet - Bevezetés</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="index.html">El&#337;z&#337;</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="ch01s02.html">Következ&#337;</a></td></tr></table><hr></div><div class="chapter" title="1. fejezet - Bevezetés"><div class="titlepage"><div><div><h2 class="title"><a name="d0e76"></a>1. fejezet - Bevezetés</h2></div></div></div><p>A mai követelményeknek megfelel&#337; alkalmazások iparszer&#369; fejlesztése összetett folyamat,
         és megfelel&#337; technológia hátteret igényel. Az évek során kialakult szoftver technológiai
         folyamat ajánlások (módszertanok) eleinte az egyéb jelleg&#369; gyártási folyamatokat vették
         mintának, amelyek azonban a szoftver, mint termék és el&#337;állítási folyamatának
         jellegzetességei miatt csak korlátozottan voltak felhasználhatók. Napjainkra azonban
         kialakultak azok az alapvet&#337; elvek, amelyek ezen a területen is alkalmazhatók.</p><p>A jegyzet az informatikus alapszakok Szoftver technológia cím&#369; tárgyának anyagához
         kapcsolódik. Célja megismertetni az olvasót az alkalmazások fejlesztésnek alapvet&#337;
         munkafolyamataival és az ennek segítésére kialakult eszközkészlettel. Olyan ismereteket
         foglal össze, melyeknek birtokában a hallgatók képesek lesznek végzés után a gyakorlatban
         folyó fejlesztési folyamatokba bekapcsolódni, és saját résztevékenységüket a teljes
         folyamatban elhelyezni, a folyamat többi részvev&#337;jével megfelel&#337;en kommunikálni.</p><p>Ennek érdekében összefoglalja a szoftver technológia fogalmát, alapvet&#337; sajátosságait, a
         folyamat bonyolultságát eredményez&#337; tényez&#337;ket. Áttekinti az id&#337;k során kialakult szoftver
         folyamat modelleket, a klasszikus modellekt&#337;l a modern személetmódokig. Hangsúlyozza a
         szoftver fejlesztés modell szemlélet&#369; megközelítését. Részletesen foglalkozik a szabványos
         UML (Unified Modelling Language) jelölésrendszerrel, amelynek ismerete ma már
         nélkülözhetetlen egy fejlesztés részvev&#337;i közötti kommunikációban. Az alapvet&#337;
         munkafolyamatok közül els&#337;sorban az analízis és tervezés lépéseivel foglalkozik, de rövid
         kitekintést ad a további tevékenységekr&#337;l is.</p><p>A jegyzet az elméleti ismeretekb&#337;l azokat a legszükségesebbeket foglalja össze, amelyek
         a helyes szemléletmód kialakításához szükségesek, alapvet&#337;en a gyakorlatias megközelítésre
         törekszik.</p><p>Az UML áttekintése során nem csak elszigetelt jelölési példákat mutat be, hanem
         igyekszik bemutatni azt, hogy egy adott probléma megoldása során az egyes UML eszközök
         hogyan képesek reprezentálni egy összefügg&#337; modell elemeit.</p><p>Bár els&#337;sorban a legalapvet&#337;bb ismeretek összegy&#369;jtésére törekszik, az érdekl&#337;d&#337;bb
         hallgatók számára a törzsanyagon túlmutató információkat is tartalmaz.</p><p>A mesterszakos hallgatók is felhasználhatják a jegyzetet ismereteik felújítására, az
         esetleges hiányzó ismeretanyag pótlására, ezáltal könnyebben be tudnak kapcsolódni a
         témával foglalkozó mester szint&#369; tárgy feldolgozásába.</p><div class="sect1" title="1.1. A jegyzet használata"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e93"></a>1.1. 
            
            <a name="__RefHeading__7_120998265"></a>A jegyzet használata</h2></div></div></div><p>A jegyzet négy f&#337; részre tagolódik.</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>Az alapvet&#337; elméleti háttér összefoglalása: 1.-6. fejezetek. </p></li><li class="listitem"><p>Az UML elemeinek ismertetése: 7.-10. fejezetek. (A 8. fejezetb&#337;l csak az els&#337;
                  három alpont.)</p></li><li class="listitem"><p>A fejlesztés modell szemlélet&#369; bemutatása: a 8. fejezet negyedik és ötödik
                  alpontja, valamint a 11.-13. fejezetek.</p></li><li class="listitem"><p>Kiegészít&#337; anyagok, az érdekl&#337;d&#337;bb hallgatóknak: 14.-15. fejezet. Nem
                  feltétlenül képezik részét egy BSc szint&#369; tárgynak.</p></li></ol></div><p>A Miskolci Egyetemen a Szoftver technológia tárgy számonkérése elméleti és gyakorlati
            részb&#337;l áll. Az elméleti számonkérés félév végi beszámoló formájában és a
            számítástechnika szigorlat részeként történik. Ezekre a számonkérésekre az els&#337; két
            blokk alapján célszer&#369; felkészülni. A gyakorlati számonkérés formája csoportmunkában
            megoldandó féléves feladat. Ennek a feladatnak az elkészítéséhez nyújt segítséget a
            jegyzet harmadik blokkja.</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="index.html">El&#337;z&#337;</a>&nbsp;</td><td width="20%" align="center">&nbsp;</td><td width="40%" align="right">&nbsp;<a accesskey="n" href="ch01s02.html">Következ&#337;</a></td></tr><tr><td width="40%" align="left" valign="top"> Szoftverfejlesztés&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Tartalom</a></td><td width="40%" align="right" valign="top">&nbsp;1.2. 
            
            Történelem: a szoftver technológia kialakulása
            és fejl&#337;dése</td></tr></table></div></body>
<!-- Mirrored from gyires.inf.unideb.hu/KMITT/c02/ch01.html by HTTrack Website Copier/3.x [XR&CO'2014], Fri, 27 Jan 2023 20:33:42 GMT -->
</html>