<html>
<!-- Mirrored from gyires.inf.unideb.hu/KMITT/c02/ch02s06.html by HTTrack Website Copier/3.x [XR&CO'2014], Fri, 27 Jan 2023 20:33:43 GMT -->
<head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>2.6. RUP folyamatmodell</title><link rel="stylesheet" href="style.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.75.2"><link rel="home" href="index.html" title="Szoftverfejlesztés"><link rel="up" href="ch02.html" title="2. fejezet - A szoftverfejlesztés életciklus modelljei"><link rel="prev" href="ch02s05.html" title="2.5. A V-modell"><link rel="next" href="ch02s07.html" title="2.7. Ellen&#337;rz&#337; kérdések"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">2.6. 
            
            RUP folyamatmodell</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch02s05.html">El&#337;z&#337;</a>&nbsp;</td><th width="60%" align="center">2. fejezet - A szoftverfejlesztés életciklus modelljei</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="ch02s07.html">Következ&#337;</a></td></tr></table><hr></div><div class="sect1" title="2.6. RUP folyamatmodell"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e564"></a>2.6. 
            
            <a name="__RefHeading__29_120998265"></a>RUP folyamatmodell</h2></div></div></div><p>A Rational Unified Process (RUP) jó példája a modern folyamatmodelleknek, me­lyek az
            UML-b&#337;l és a hozzá kapcsolódó Unified Software Development Process-b&#337;l származnak. A
            szoftverfejlesztési modellt a Rational Software Corporation fejlesztett ki, melyek
            kés&#337;bb az IBM is felvásárolt. A RUP már a szemléletmód alapjaiban szeretne különbözni a
            közismert folyamatmodellekt&#337;l. Felismeri, hogy a konvencionális folyamatmodellek a
            folyamatoknak csak egy egyszer&#369; nézetét adják, ezért er&#337;sen érz&#337;dik a felépítés hibrid
            jellege, ugyanis mindegyik korábban tárgyalt általános folyamatmodellb&#337;l tartalmaz
            elemeket. Támogatja az iterációt, és jól illusztrálja a specifikáció és a tervezés
            tevékenységeit. A RUP nem egy kész, követend&#337; eljárást ad minden projektre, sokkal
            inkább egy könnyen változtatható keretet azok kézbentartásához.</p><p>Célja az olyan termékek el&#337;állításának biztosítása, melyek rendelkeznek elég magas
            min&#337;ségi színvonallal és a kívánt szolgáltatásokkal, miközben az id&#337;beli ütemezés és a
            költségvetés határai nem lettek megsértve. Ennek a folyamatnak négy szerepe van:</p><p>Ezért az RUP a rendszerfejlesztés folyamatát alapvet&#337;en három dimenzióval írja
            le:</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>Dinamikus perspektívával, amely a modell fázisait mutatja.</p></li><li class="listitem"><p>Statikus perspektívával, amely a végrehajtandó folyamattevékenységeket
                  mu­tatja.</p></li><li class="listitem"><p>Gyakorlati perspektívával, amely jól hasznosítható gyakorlatokat javasol a
                  fo­lyamat alatt.</p></li></ol></div><p></p><p>Az id&#337;beliség alapján az RUP a rendszerfejlesztést négy nagyobb egységre, négy
            diszkrét fázisrabontja. Ezek a kijelölt fázisok sokkal közelebb állnak az üz­leti
            vonatkozásokhoz, mint a technikaiakhoz. A következ&#337; ábra bemutatja ezeket:</p><div class="figure"><a name="d0e588"></a><p class="title"><b>2.7. ábra - Fázisok és munkafolyamatok</b></p><div class="figure-contents"><div align="center"><img src="images/image7.png" align="middle" alt="Fázisok és munkafolyamatok"></div></div></div><br class="figure-break"><div class="sect2" title="2.6.1. &nbsp;RUP rendszerfejlesztési fázisok"><div class="titlepage"><div><div><h3 class="title"><a name="d0e592"></a>2.6.1. &nbsp;RUP rendszerfejlesztési fázisok</h3></div></div></div><p>A következ&#337;kben bemutatjuk a modellre jellemz&#337; rendszerfejlesztési
               fázisokat.</p><p>El&#337;készítés</p><p>Az El&#337;készítés (inception) fázisában a rendszer eredeti ötletét olyan részletes
               elképzeléssé dolgozzuk át, mely alapján a fejlesztés tervezhet&#337; lesz, a költségei
               pedig megbecsülhet&#337;k. Ebben a fázisban megfogalmazzuk, hogy a felhasználók milyen
               módon fogják használni a rendszert és hogy annak milyen alapvet&#337;bels&#337; szerkezetet,
               architektúrát alakítunk ki.</p><p>Kidolgozás</p><p>A Kidolgozás (elaboration) fázisában a használati módokat, a &#8222;használati eseteket&#8221;
               részleteiben is kidolgozzuk, valamint össze kell állítanunk egy stabil
               alaparchitektúrát (architecturebaseline). A Unified Process készít&#337;inek a képe
               alapján a teljes rendszer egy testnek tekinthet&#337;, csontváznak, b&#337;rnek és izmoknak. Az
               alaparchitektúra ebb&#337;l a b&#337;rrel borított csontváz, mely mindössze a minimális
               összeköt&#337; izomzatot tartalmazza, annyit, amennyi a legalapvet&#337;bb mozdulatokhoz
               elegend&#337;. Az alap-architektúra segítségével a teljes fejlesztés folyamata ütemezhet&#337;
               és a költségei is tisztázhatók.</p><p>Megvalósítás</p><p>A Megvalósítás (construction) során a teljes rendszert kifejlesztjük, beépítjük az
               összes &#8222;izomzatot&#8221;. Legf&#337;képpen a rendszertervvel, a programozás­sal és a
               teszteléssel foglalkozik. A rendszer különböz&#337; részei párhuzamosan fejleszthet&#337;k,
               majd ez alatt a fázis alatt integrálhatók. A fázis teljesítése után már rendelkezünk
               egy m&#369;köd&#337; szoftverrendszerrel és a hozzá csatlakozó do­kumentációval, amely készen
               áll, hogy leszállítsuk a felhasználónak.</p><p>Átadás</p><p>Az Átadás (transition) a rendszer bétaváltozatának kipróbálását jelenti, mely
               során néhány gyakorlott felhasználó teszteli a rendszert és jelentést készít annak
               helyességér&#337;l vagy a hibáiról és hiányosságairól. A megjelen&#337; hibákat ki kell
               küszöbölni, a még hiányzó részeket ki kell fejleszteni.</p></div><div class="sect2" title="2.6.2. &nbsp;Mérföldkövek"><div class="titlepage"><div><div><h3 class="title"><a name="d0e613"></a>2.6.2. &nbsp;Mérföldkövek</h3></div></div></div><p></p><p>Minden fázis vége a fejlesztés egy-egy jól meghatározott mérföldkövét (milestone)
               jelenti, azaz olyan pontot, ahol egy célt kell elérnünk, illetve ahol kritikus
               döntéseket kell meghozni. Minden fázis végén megvizsgáljuk az eredményeket és döntünk
               a folytatásról.</p><div class="figure"><a name="d0e619"></a><p class="title"><b>2.8. ábra - Fázisok id&#337;- és er&#337;forrásigénye</b></p><div class="figure-contents"><div align="center"><img src="images/image8.png" align="middle" alt="Fázisok id&#337;- és er&#337;forrásigénye"></div></div></div><br class="figure-break"><p>A fejlesztés nagyobb egységeit jelent&#337; fázisok további kisebb egységekre,
               iterációkra (iteration) bonthatók. Minden iteráció egy teljes, illetve részben önálló
               fejlesztési ciklust jelent, mivel az iteráció végén egy m&#369;köd&#337; és végrehajtható
               alkalmazásnak kell el&#337;állnia. Minden iteráció végén így a végs&#337;, teljes rendszer
               egyre b&#337;vül&#337; részét kapjuk eredményül, melyeket a rendszer egymás utáni
               kibocsátásainak (release), vagy bels&#337; változatainak nevezünk. A bels&#337; változatok
               lehet&#337;vé teszik, hogy azt a fejleszt&#337;k kipróbálhassák és annak tapasztalatai alapján
               esetleg módosíthassák a fejlesztés ütemezését.</p><p></p><p></p><div class="figure"><a name="d0e627"></a><p class="title"><b>2.9. ábra - Mérföldkövek</b></p><div class="figure-contents"><div align="center"><img src="images/image10.png" align="middle" alt="Mérföldkövek"></div></div></div><br class="figure-break"></div><div class="sect2" title="2.6.3. &nbsp;A fejlesztés további dimenziója"><div class="titlepage"><div><div><h3 class="title"><a name="d0e631"></a>2.6.3. &nbsp;A fejlesztés további dimenziója</h3></div></div></div><p></p><p>A Unified Process felbontását követve a fejlesztés menetének másik dimenziója az
               eljárás elemeit határozza meg. Ezen elemek azt szimbolizálják, hogy a fejlesztés
               során milyen dokumentumokat, diagramokat, forráskódokat &#8211; összefoglaló néven
               produktumokat (artifact) &#8211; készítsünk el. Az elkészítend&#337; produktumok természetesen a
               megfelel&#337; tevékenységekkel állíthatók össze, mely tevékenységeket pedig adott
               szakismerettel rendelkez&#337; személyek (&#8222;dolgozók&#8221;), adott sorrendben hajthatnak végre.
               A tevékenységek, azok id&#337;beli sorrendje és az azt végrehajtó dolgozók együttesen egy
               munkafolyamattal (workflow) írhatók le. A RUP gyakorlatilag az UML-lel együtt került
               kifejlesztésre, így a munkafolyamatok leírása UML-modellekkel történik.</p><p></p><p>A fejlesztéshez kezdetben mindig egy megfelel&#337; kiindulópontot kell keresni. Az
               els&#337; tevékenységcsoport így az üzleti modellezés (business model) lesz, mely során
               megkeressük a készítend&#337; rendszer üzleti vagy más néven szakterületi környezetét,
               mely alapvet&#337;en az üzleti fogalmakat és folyamatokat jelentik, illetve az azokra
               hatást gyakorló üzleti munkatársakat.</p><p>Második fontos tevékenység a követelmények meghatározása (requirement capture).
               Ezen munkafolyamat során összegy&#369;jtjük és felsoroljuk a rendszer m&#369;ködésével szemben
               támasztott kezdeti elképzeléseket, leírjuk azt, hogy a rendszernek milyen
               környezetben kell m&#369;ködnie, valamint felsoroljuk a funkcionális (m&#369;ködéssel
               kapcsolatos) és nem-funkcionális (pl. válaszid&#337;k, b&#337;víthet&#337;ség, alkalmazott
               technológiák, stb.) követelményeket. A követelmények meghatározása során alapvet&#337;en a
               felhasználók szempontjából írjuk le a rendszert, így annak egy küls&#337; képét rögzítjük. </p><p>A következ&#337; munkafolyamat, az elemzés (analysis) folyamán a követelményeket a
               fejleszt&#337;k szempontjának megfelel&#337;en rendezzük át, így azok együttesen a rendszer egy
               bels&#337; képét határozzák meg, mely a további fejlesztés kiindulópontja lesz. Az elemzés
               során rendszerezzük és részletezzük az összegy&#369;jtött használati eseteket, valamint
               azok alapján meghatározzuk a rendszer alapstruktúráját.</p><p>Az elemzés célja a szerkezeti váz kialakítása, mely vázat a következ&#337;
               munkafolyamat, a tervezés (design) formálja teljes alakká és tölti fel konkrét
               tartalommal, mely az összes &#8211; funkcionális és nem-funkcionális &#8211; követelménynek is
               eleget tesz. A tervezésnek az implementációval kapcsolatos összes kérdést meg kell
               válaszolnia, így részletesen le kell írni az összes felhasznált technológiát, a
               rendszert független fejleszt&#337;i csoportok által kezelhet&#337; részekre kell bontani, meg
               kell határozni az alrendszereket és közöttük a kapcsolódási módokat, protokollokat. A
               tervezésnek a rendszert olyan részletezettségi szinten kell vázolnia, melyb&#337;l az
               közvetlenül, egyetlen kérdés és probléma felvetése nélkül implementálható. </p><p>Az implementáció (implementation) során a rendszert az UML terminológiája szerinti
               komponensekként állítjuk el&#337;, melyek forráskódokat, bináris és futtatható
               állományokat, szövegeket (pl. súgó), képeket, stb. jelentenek. Az állományok
               el&#337;állítása egyben azok függetlenül végrehajtható, önálló tesztjeit is jelentik. Az
               implementáció feladata még az architektúra, illetve a rendszer, mint egésszel
               kapcsolatos kérdések megválaszolása, így az iteráció esetén szükséges
               rendszerintegráció tervezése, az osztottság (distribution) tervezése.</p><p>Az utolsó munkafolyamat, a teszt (test) során összeállítjuk az iterációkon belüli
               integrációs tesztek és az iterációk végén végrehajtandó rendszertesztek ütemtervét.
               Azaz megtervezzük és implementáljuk a teszteket, tehát teszt-esetekként megadjuk,
               hogy mit kell tesztelnünk, teszt-eljárásokként. Megadjuk azok végrehajtási módját, és
               programokat készítünk, ha lehetséges a tesztek automatizálása. A tesztek
               végrehajtásával párhuzamosan azok eredményeit szisztematikusan feldolgozzuk, majd
               hibák vagy hiányosságok esetén újabb tervezési vagy implementációs tevékenységeket
               hajtunk végre.</p><p></p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="ch02s05.html">El&#337;z&#337;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="ch02.html">Fel</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="ch02s07.html">Következ&#337;</a></td></tr><tr><td width="40%" align="left" valign="top">2.5. 
            
            A V-modell&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Tartalom</a></td><td width="40%" align="right" valign="top">&nbsp;2.7. Ellen&#337;rz&#337; kérdések</td></tr></table></div></body>
<!-- Mirrored from gyires.inf.unideb.hu/KMITT/c02/ch02s06.html by HTTrack Website Copier/3.x [XR&CO'2014], Fri, 27 Jan 2023 20:33:44 GMT -->
</html>