<html>
<!-- Mirrored from gyires.inf.unideb.hu/KMITT/c02/ch05s03.html by HTTrack Website Copier/3.x [XR&CO'2014], Fri, 27 Jan 2023 20:33:45 GMT -->
<head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>5.3. &nbsp;Szoftverkövetelmények dokumentuma</title><link rel="stylesheet" href="style.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.75.2"><link rel="home" href="index.html" title="Szoftverfejlesztés"><link rel="up" href="ch05.html" title="5. fejezet - Követelmény analízis"><link rel="prev" href="ch05s02.html" title="5.2. &nbsp;A szoftver követelmények"><link rel="next" href="ch05s04.html" title="5.4. Ellen&#337;rz&#337; kérdések"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">5.3. 
            
            &nbsp;Szoftverkövetelmények dokumentuma</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch05s02.html">El&#337;z&#337;</a>&nbsp;</td><th width="60%" align="center">5. fejezet - Követelmény analízis</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="ch05s04.html">Következ&#337;</a></td></tr></table><hr></div><div class="sect1" title="5.3. &nbsp;Szoftverkövetelmények dokumentuma"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e1381"></a>5.3. 
            
            <a name="__RefHeading__55_120998265"></a>&nbsp;Szoftverkövetelmények dokumentuma</h2></div></div></div><p>A szoftverkövetelmények dokumentuma a szoftverspecifikációs fázis végeredménye, amely
            tartalmazza a rendszer felhasználói követelményeit és a rendszerkövetelmények részletes
            specifikációját. Hivatalos leírása annak, amit a rendszerfejleszt&#337;knek meg kell
            valósítani. Miel&#337;tt javaslatot tennék a dokumentum felépítésére, vizsgáljuk meg azt,
            hogy kik a követelménydokumentum felhasználói. &#336;k a rendszerért fizet&#337; fels&#337;vezet&#337;kt&#337;l
            kezdve egészen a fejleszt&#337;kig.</p><p></p><div class="figure"><a name="d0e1389"></a><p class="title"><b>5.3. ábra - A követelménydokumentum használói</b></p><div class="figure-contents"><div align="center"><img src="images/image14.png" align="middle" alt="A követelménydokumentum használói"></div></div></div><br class="figure-break"><p>Látható, hogy több felhasználó is megjelenik, ezért a dokumentumnak minden rétegre
            kiterjed&#337;nek kell lennie. A fejlesztett rendszer típusától és a használt fejlesztési
            folyamattól függ, hogy milyen szint&#369; részleteket érdemes tartalmaznia a követelmények
            dokumentumának. &nbsp;Ha a rendszert egy kívülálló vállalkozó fogja fejleszteni, akkor
            rendszerspecifikációnak pontosnak és nagyon részletesnek kell lenni. Ha azonban a
            fejlesztés házon belül iteratív módon megy végbe, akkor a követelmények dokumentuma
            kevésbé részletes is lehet.</p><p></p><div class="sect2" title="5.3.1. A dokumentum felépítése"><div class="titlepage"><div><div><h3 class="title"><a name="d0e1396"></a>5.3.1. A dokumentum felépítése</h3></div></div></div><p>A követelmények
               dokumentumának felépítése nagyon változatos lehet. Különböz&#337; szervezetek más és más
               megoldásokat követhetnek a leírás elkészítéséhez. Természetesen nem definiálható
               olyan dokumentum felépítés, amely minden cég számára kielégít&#337; formát alkothatna, de
               azért javaslatokat tehetünk a dokumentum gerincének felépítésére. A dokumentum
               felépítésére számos nagy szervezet definiált szabványokat. A legismertebb szabvány az
               IEEE/ANSI 830-1998-as. A szabvány nem ideális, de rengeteg jó tanácsot fogalmaz meg a
               követelmények lefektetésével kapcsolatban. Az alábbi felsorolásban egy IEEE
               szabványon alapuló lehetséges követelménydokumentum lehetséges szervezését mutatjuk
               be:</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>El&#337;szó</p></li></ol></div><p>Körvonalazza a dokumentum célzott olvasóit, ós leírja a verzió történetét,
               beleértve egy új verzió létrehozásának magyarázatát és az egyes verziókban végzett
               változtatások összefoglalását.</p><p></p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>Bevezetés</p></li></ol></div><p>Indokolja, miért van szükség a rendszerre. Röviden leírja annak funkcióit, és
               elmagyarázza, hogyan fog együttm&#369;ködni más rendszerekkel Leírja, hogyan illeszkedik a
               rendszer a szoftvert megrendel&#337; vállalat átfogó üzleti vagy straté­giai céljai
               közé.</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>Szójegyzék</p></li></ol></div><p>A szójegyzékben a leírásban használt szakkifejezéseket vázolhatjuk. Ezt fontos
               megtenni, mert az olvasó szakképzettségét nem tudjuk megbecsülni.</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>Felhasználói követelmények definíciói</p></li></ol></div><p>Minden felhasználói és a nem funkcionális követelményt ebben a fejezetben célszer&#369;
               vázolni. A leírásban alkalmazhatunk természetes nyelvet, diagramokat vagy egyéb, a
               megrendel&#337; számára érthet&#337; jelöléseket. A követend&#337; termék- és folyamatszabványokat
               is célszer&#369; megadnunk.</p><p></p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>A rendszer felépítése</p></li></ol></div><p>A tervezett rendszerfelépítés magas szint&#369; áttekintése, bemutatva, hogyan oszlanak
               el a funkciók a különböz&#337; rendszermodulok között. Az újrafelhasznált, architektúrális
               komponenseket ki kell emelnünk.</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>Rendszerkövetelmény specifikáció</p></li></ol></div><p>A funkcionális és nem funkcionális követelmények részletesebb leírása Amennyiben
               szükséges, a nem funkcionális követelmények további részletekkel egészíthet&#337;k ki,
               például definiálhatunk interfészeket más rendszerekhez.</p><p></p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>Rendszermodellek</p></li></ol></div><p>Egy vagy több rendszermodellt ad meg, megmutatva a rendszerkomponen­sek, a
               rendszer és annak környezete közötti kapcsolatokat. Ezek lehetnek objektummodellek,
               adatfolyam modellek és szemantikus adatmodellek.</p><p></p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>Rendszerevolúció</p></li></ol></div><p>Leírja a rendszer alapját képez&#337; feltételezéseket, továbbá vázolja a hardver
               fejlesztése, a változó felhasználói igények stb. következtében bekövetkez&#337; el&#337;re
               látható változásokat.</p><p></p><p></p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>Függelék</p></li></ol></div><p>Részletes, specifikus információt kell nyújtani itt a fejlesztett alkalmazásról. A
               csatolt függelékekre példa a hardver- vagy az adatbázis-leírások. A
               hardver­követelmények meghatározzák a rendszer minimális és optimális
               konfigurá­cióját. Az adatbázis-követelmények megadják a rendszer által használt
               adatok logikai szerkezetét és a köztük lév&#337; kapcsolatokat.</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>Tárgymutató</p></li></ol></div><p>A dokumentum több tárgymutatót is tartalmazhat. Szerepelhet még a diagramok,
               funkciók indexe is.</p><p>A dokumentációnak tehát mindig egy egységes anyagnak kell lennie. A fejlesztési
               módszertan alapjaiban befolyásolhatja a dokumentum felépítését, illetve annak
               részletességét. Ha például egy fejleszt&#337; cég az evolúciós modellt választja
               irányelvként egy termék kifejlesztésekor, akkor több javasolt részletes fejezet
               hiányozni fog. Ilyenkor a hangsúly inkább a felhasználói követelmények és a magas
               szint&#369;, nem funkcionális rendszerkövetelmények irányába tolódik el.</p><p>Szintén a követelménydokumentum csak részleges kidolgozása mellett érvelnek az
               agilis fejlesztési mód­szertant alkalmazó fejleszt&#337;k csoportja. Véleményük szerint a
               követelmények olyan gyorsan változnak, hogy a követelmények dokumentuma már akkor
               elavult, amikor megírták, így az érte tett er&#337;feszítés javarészt hiábavaló volt. </p><p></p><p>Egyes megközelítések, mint az extrém programozás a dokumentumok gyártása helyett
               inkább azt javasolják, hogy a felhasználói követelményeket folyamatosan gy&#369;jtsük, és
               írjuk kártyákra. Majd ezek után a fel­használó rangsorolja a követelményeket, azaz
               meghatározza, melyik legyen megvalósítva a következ&#337; rendszerfejlesztési iteráció
               során.</p><p></p><p></p><p></p><p>Mint azt már korábban érzékelhettük, egy elkészítend&#337; szoftver esetén nagyon
               fontos, hogy kell&#337; figyelmet fordítsunk a követelmények meghatározására, feltárására,
               és dokumentálására. Az ebben a fázisban vétett hibák, vagy pongyola megfogalmazások
               nagymértékben befolyásolják a fejlesztés kés&#337;bbi menetét. Ezért a követelményeket
               tervezni kell, amely folyamatnak a célja a rendszerkövetelmények dokumentumának
               létrehozása és karbantartása. A teljes folyamat négy magas szint&#369; tervezési
               folyamatot foglal magába:</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>a rendszer üzleti használatának felmérése (megvalósíthatósági
                     tanulmány)</p></li><li class="listitem"><p>a követelmények feltárása és elemzése</p></li><li class="listitem"><p>a követelmények átalakítása valamilyen szabványos formátumra
                     (specifikáció)</p></li><li class="listitem"><p>ellen&#337;rzés, hogy a követelmények a megrendel&#337; által kívánt rendszert
                     definiálják-e (validálás)</p></li></ol></div><p></p><p>A következ&#337; ábra a követelmények tervezésének folyamatát mutatja be.</p><p></p><p></p><p></p><div class="figure"><a name="d0e1498"></a><p class="title"><b>5.4. ábra - A követelménytervezés folyamata</b></p><div class="figure-contents"><div align="center"><img src="images/image15.png" align="middle" alt="A követelménytervezés folyamata"></div></div></div><br class="figure-break"><p></p></div><div class="sect2" title="5.3.2. &nbsp;Megvalósíthatósági tanulmány"><div class="titlepage"><div><div><h3 class="title"><a name="d0e1503"></a>5.3.2. &nbsp;Megvalósíthatósági tanulmány</h3></div></div></div><p></p><p>A követelménytervezési folyamat els&#337; lépése minden esetben egy megvalósíthatósági
               tanulmány elkészítése kell legyen. Az eredményeket majd egy jelentésben foglaljuk
               össze, melynek bemenetéül az üzleti követelmények kezdeti változatai, a rendszer
               körvonalazott leírása szolgál. A tanulmány egy rövid, tömör dokumentum, amely a
               következ&#337; kérdésekre próbál választ adni:</p><p></p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>Támogatja-e a rendszer a vállalat általános célkit&#369;zéseit</p></li><li class="listitem"><p>Megvalósítható-e a rendszer a jelenlegi technológiával adott költségen belül
                     és adott ütemezés szerint?</p></li><li class="listitem"><p>Integrálható-e más, már használatban lév&#337; rendszerekkel?</p></li></ol></div><p></p><p>Az els&#337; kérdés, amely arra ad választ, hogy a rendszer hozzájárul-e az üzleti
               célokhoz nagyon kritikus, mert amennyiben nem járul hozzá, nincs valódi üzleti értéke
               a szoftvernek. A gyakorlatban ennek ellenére vannak olyan esetek, amikor vállalatok
               olyan rendszert fejlesztenek, ami nem járul hozzá a céljaikhoz. Ennek oka lehet az,
               hogy a célkit&#369;zések nincsenek világosan megfogalmazva, vagy nem sikerült definiálni a
               rendszer követelményeket.</p><p></p></div><div class="sect2" title="5.3.3. Követelmények feltárása és elemzése"><div class="titlepage"><div><div><h3 class="title"><a name="d0e1524"></a>5.3.3. Követelmények feltárása és elemzése</h3></div></div></div><p></p><p>A követelmények feltárása és elemzése a követelménytervezési folyamat második nagy
               részfeladata. E tevékenység során együtt kell m&#369;ködni a szoftverfejleszt&#337;knek a
               megrendel&#337;kkel és a végfelhasználókkal, azért, hogy kiderítsék milyen
               szolgáltatásokat kellene biztosítani a rendszernek. A folyamat során a tervezett vagy
               meglé­v&#337; rendszerekr&#337;l információkat gy&#369;jtünk, szisztematikusan megvizsgáljuk azok
               m&#369;ködését, majd ebb&#337;l kisz&#369;rjük a felhasználói és rendszerkövetelményeket. Itt
               kerülnek kiválasztásra az úgynevezett kulcsfigurák, akik olyan személyek vagy
               csoportok, akiknek közvetett vagy közvetlen befolyása lehet a
               rendszerkövetelményekre. A feltárás és elemzés nagy odafigyelés igényl&#337; folyamat,
               nehézségeinek több oka lehet:</p><p></p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>A gazdasági és az üzleti környezet dinamikusan változhat, amely során új
                     kulcsfigurák jelenhetnek meg, újabb követelményekkel.</p></li><li class="listitem"><p>Sok esetben a kulcsfigurák a követelmények meghatározásában félrevezet&#337;ek
                     lehetnek, mert tudják pontosan, mit várnak el a számítógépes rendszert&#337;l.
                     Bonyolult lehet számukra annak kifejezése, mit akarnak a rendszert&#337;l, vagy több
                     esetben valóságtól elrugaszkodott kívánságaik lehetnek.</p></li><li class="listitem"><p>A rendszer kulcsfigurái a saját szakterületi fogalmaikkal fejtik ki a
                     követelményeket.</p></li><li class="listitem"><p>Az egyes kulcsfiguráknak különböz&#337; követelményeik lehetnek. Ebben a
                     követelménytervez&#337;knek fel kell fedezniük a közös dolgokat és
                     ellentmondásokat.</p></li><li class="listitem"><p>A rendszerkövetelményeket politikai tényez&#337;k is befolyásolhatják. Lehetnek
                     olyan vezet&#337;k, akik azért igényelnek specifikus rendszerkövetelményeket, hogy
                     ezzel növeljék a szervezeten belüli befolyásukat.</p></li></ol></div><p></p><p>A feltárási és elemzési folyamat általános modellje:</p><p></p><p></p><div class="figure"><a name="d0e1552"></a><p class="title"><b>5.5. ábra - A feltárás és elemzés általános modellje </b></p><div class="figure-contents"><div align="center"><img src="images/image16.png" align="middle" alt="A feltárás és elemzés általános modellje"></div></div></div><br class="figure-break"><p></p><p>A folyamat lépései rövid magyarázattal:</p><p></p><p>1. A szakterület megismerése. Az elemz&#337;knek fejleszteniük kell az alkalmazás
               szakterületére vonatkozó ismereteiket.</p><p>2. Követelmények összegy&#369;jtése. A rendszer kulcsfiguráival való együttm&#369;ködés.
               Eközben javul a szakterület megértése.</p><p>3. Osztályozás. A követelmények strukturálatlan gy&#369;jteményét összefügg&#337;csoportokba
               szervezi.</p><p>4. Ellentmondások feloldása. Ahol több kulcsfigura is érintett, elkerülhetetlen,
               hogy a követelmények ellentmondásba ne kerüljenek.</p><p>5. Fontossági sorrend felállítása. A kulcsfigurákkal együttm&#369;ködve, kiválasztjuk a
               legfontosabb követelményeket.</p><p>6. Követelményellen&#337;rzés. Teljes-e, ellentmondásmentes-e és összhangban van-e
               azzal, amit a kulcsfigurák a rendszert&#337;l valójában várnak.</p><p></p><p>A követelmények feltárásának és elemzésének támogatására több technika alakult ki
               az évek során. A következ&#337;kben három technikát tekintünk át röviden.</p><div class="sect3" title="5.3.3.1. &nbsp;Néz&#337;pont-orientált szemlélet"><div class="titlepage"><div><div><h4 class="title"><a name="d0e1575"></a>5.3.3.1. &nbsp;Néz&#337;pont-orientált szemlélet</h4></div></div></div><p>A néz&#337;pont-orientált szemléletek a feltárási folyamatot, és magukat a
                  követelményeket néz&#337;pontok segítségével rendsze­rezik. A legf&#337;bb er&#337;ssége az, hogy
                  felismeri a több­féle perspektívát, és eszközöket nyújt a követelmények
                  ellentmondásainak felderítésére.</p><p>A néz&#337;pontok a kulcsfigurák és egyéb követelményforrások egyfajta
                  osztályozására használhatók. A néz&#337;pontok típusai:</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>Interaktor néz&#337;pontok: olyan személyek vagy rendszerek, amelyek a
                        rendszerrel közvetlenül érintkeznek.</p></li><li class="listitem"><p>Közvetett néz&#337;pontok: azon kulcsfigurák, akik nem használ­ják ugyan
                        közvetlenül a rendszert, de a követelményeket valahogyan befolyá­solják.
                        Például egy bank vezet&#337;sége és a bank biztonsági személyzete.</p></li><li class="listitem"><p>Szakterületi néz&#337;pontok: a szakterület azon jellegzetességei és
                        megszorításai, amelyek a rendszerkövetelményeket közvetlenül befolyásolják.
                        Például a bankok közötti kommunikációra kifejlesztett szabványok.</p></li></ol></div><p>A felsorolt néz&#337;pont típusok a követelményeket jellemz&#337;en különböz&#337;féleképpen
                  értelmezik. Az interaktor néz&#337;pontok részletes rendszerkövetelményeket írnak le,
                  ame­lyek lefedik a rendszer eszközeit és interfészeit. A közvetett néz&#337;pontok
                  inkább magas szint&#369; szervezeti követelményeket és megszorításokat közvetítenek,
                  végül a szakterületi néz&#337;pontok pedig rendszerint a rendszerre vonatkozó
                  szakterületi meg­szorításokat nyújtják.</p><p>A követelményeket adó néz&#337;pontok származhatnak még a vállalat marketing- és a
                  küls&#337; kapcsolatokért felel&#337;s osztályáról is. Ez különösen igaz a web alapú
                  rendszereknél, f&#337;leg az e-kereskedelmi rendszereknél és a dobozos
                  szoft­vertermékeknél. Ennek oka, hogy a web alapú rendszereknek kedvez&#337; képet is
                  kell mutatniuk a vállalatról.</p><p>Nem triviális, komplex szoftverek esetén rengeteg lehetséges néz&#337;pont van, és
                  gya­korlatilag lehetetlen mindegyikb&#337;l feltárni a követelményeket. Ilyenkor egy
                  segítség lehet a néz&#337;pontok rendszerezése és hierarchiába szervezése. Az azonos
                  ágon lév&#337; néz&#337;pontoknak nagy valószín&#369;séggel közösek lesznek a
                  követelményeik.</p></div><div class="sect3" title="5.3.3.2. &nbsp;Forgatókönyvek"><div class="titlepage"><div><div><h4 class="title"><a name="d0e1598"></a>5.3.3.2. &nbsp;Forgatókönyvek</h4></div></div></div><p>A forgatókönyvek interakció-soro­zat leírások, amelyek különösen akkor
                  hasznosak, ha további részletekkel szeret­nénk kiegészíteni a követelmények
                  körvonalazott leírását. Minden forgatókönyv egy vagy több lehetséges interakciót
                  takar. Számos forgatókönyvtípust kifejlesztettek már, ezek mind különböz&#337;
                  részletezettség&#369;, különböz&#337; típusú információkat nyújtanak a rendszerr&#337;l.</p><p>Egy forgatókönyv készítése mindig az interakció körvonalazásával kezd&#337;dik. A
                  feltárás alatt további részletekkel b&#337;vítjük, hogy végül az interakció teljes
                  leírása megszülessen. Egy forgatókönyv általánosan a alábbiakat tartalmazhatja: </p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>a rendszer, illetve a felhasználói elvárások;</p></li><li class="listitem"><p>a forgatókönyvbeli események normális menetének leírása;</p></li><li class="listitem"><p>leírást arról, mi romolhat el, és ezt hogyan kezeli a rendszer;</p></li><li class="listitem"><p>egyéb tevékenységek leírása, amelyek ugyanabban az id&#337;ben mehetnek
                        végbe;</p></li><li class="listitem"><p>a rendszer végállapotának leírását a forgatókönyv befejez&#337;désekor.</p></li></ol></div><p>A forgatókönyvek meg­fogalmazhatók szövegesen, kiegészíthet&#337;k diagramokkal,
                  képerny&#337;képekkel és így tovább. Másik lehet&#337;ségként alkalmazhatunk strukturáltabb
                  megközelítést jelent&#337; esemény-forgatókönyveket vagy használati eseteket. A
                  használati esetek (use-case-ek) az UML jelölésrendszer részei.</p></div><div class="sect3" title="5.3.3.3. Etnográfia"><div class="titlepage"><div><div><h4 class="title"><a name="d0e1623"></a>5.3.3.3. Etnográfia</h4></div></div></div><p>Az etnográfia egy olyan technika, amelynek célja a társa­dalmi és szervezeti
                  követelmények jobb megértése a követelmény-feltárási folyamatban. Megfigyelésen
                  alapul, miszerint az elemz&#337; elmélyed abban a munkakörnyezetben, ahol a rendszert
                  majd használni fogják. Megfigyeli a napi munkát, és jegyzeteket készít az aktuális
                  feladatokról.</p><p>Azért tartják fontosnak ezt a technikát, mert az emberek gyakran nehéznek
                  találják kifejezni munkájuk részleteit, ez ter­mészetükb&#337;l fakad. Sok esetben
                  megértik azt a munkát amit végeznek, de azt gyakran nem, hogy ez a munka milyen
                  összefüggésben áll a szervezet többi munkájával. Ezek a társadalmi és szervezeti
                  tényez&#337;k viszont rögtön világossá válnak, ha egy kívülálló személy, egy
                  tárgyilagos megfigyel&#337; figyelemmel kíséri a folyamatokat.</p><p>Az etnográfiai elemzés során készített tanulmányok a folyamat azon kritikus
                  részleteit tárhatják fel, amelyek más feltárási technikáknál gyakran elmaradnak.
                  Ugyanakkor, mivel a hangsúly a végfelhasználón van, ez a megközelítés nem alkalmas
                  a szervezeti vagy a szakterületi követelmények felderítésére. Az etnográfia ezért
                  nem alkalmas a követelmények önálló, teljes érték&#369; feltárására, célszer&#369; más
                  módszerekkel együtt alkalmazni. Jellegzetes példáként említhet&#337; a használati
                  esetek elemzése.</p><p></p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="ch05s02.html">El&#337;z&#337;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="ch05.html">Fel</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="ch05s04.html">Következ&#337;</a></td></tr><tr><td width="40%" align="left" valign="top">5.2. 
            
            &nbsp;A szoftver követelmények&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Tartalom</a></td><td width="40%" align="right" valign="top">&nbsp;5.4. 
         Ellen&#337;rz&#337; kérdések</td></tr></table></div></body>
<!-- Mirrored from gyires.inf.unideb.hu/KMITT/c02/ch05s03.html by HTTrack Website Copier/3.x [XR&CO'2014], Fri, 27 Jan 2023 20:33:45 GMT -->
</html>