<html>
<!-- Mirrored from gyires.inf.unideb.hu/KMITT/c02/ch15s02.html by HTTrack Website Copier/3.x [XR&CO'2014], Fri, 27 Jan 2023 20:34:06 GMT -->
<head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>15.2. 15.2 Projekt menedzsment áttekintése</title><link rel="stylesheet" href="style.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.75.2"><link rel="home" href="index.html" title="Szoftverfejlesztés"><link rel="up" href="ch15.html" title="15. fejezet - További fejlesztési tevékenységek áttekintése"><link rel="prev" href="ch15.html" title="15. fejezet - További fejlesztési tevékenységek áttekintése"><link rel="next" href="ch15s03.html" title="15.3. 15.3 Konfigurációkezelés"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">15.2. 
      
            15.2 Projekt menedzsment áttekintése</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch15.html">El&#337;z&#337;</a>&nbsp;</td><th width="60%" align="center">15. fejezet - További fejlesztési tevékenységek áttekintése</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="ch15s03.html">Következ&#337;</a></td></tr></table><hr></div><div class="sect1" title="15.2. 15.2 Projekt menedzsment áttekintése"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e6279"></a>15.2. 
      
            <a name="__RefHeading__171_120998265"></a>15.2 Projekt menedzsment áttekintése</h2></div></div></div><p>A szoftverprojekt-menedzsment fontos része a szoftvertervezésnek. Szakirodalma az elmúlt évtizedekben rengeteget fejl&#337;dött, nagyon szerteágazó. Jelen dokumentumban sajnos nincs lehet&#337;ségünk ennek teljes áttekintésére így egy általános bemutatásra, néhány fontosabb menedzs­menttevékenységre kell szorítkoznunk.</p><p>A szoftvermenedzserek felel&#337;ssége megtervezni és ütemezni a fejlesztési pro­jektet. &#336;k felügyelik a munkát, hogy biztosítsák, az a szükséges szabványok sze­rint van végrehajtva. Megfigyelik és folyamatosan ellen&#337;rzik, hogy a fejlesztés megfelel&#337; id&#337;terv és költségvetés szerint halad. A jó me­nedzsment persze nem garantálja még a projekt sikerét. Mindazonáltal a rossz menedzsment általában a projekt sikertelenségét okozza. A szoftvert kés&#337;n szál­lítják le, a költségek meghaladják az eredetileg tervezett költségeket, és az is el&#337;­fordulhat, hogy nem fognak megfelelni a követelményeknek.</p><p>A szoftverek projektmenedzsmentjét számos tényez&#337; tovább bonyolítja. Mégpedig az, hogy egy szoftver tervezése számos tekintetben külön­bözik minden más egyéb területen végzett tervezést&#337;l. Néhány ilyen különbség:</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>A szoftver nem kézzelfogható: a szoftver megfoghatatlan. Nem látható vagy tapintható. A szoftverprojekt menedzserei nem látják annak haladását. Csak arra támaszkodhatnak, hogy a projekt átvizsgálásához szükséges doku­mentációt mások el&#337;állítják.</p></li><li class="listitem"><p>Nincsenek szabványos szoftverfolyamatok: a mérnö­ki tudományágakkal ellentétben a szoftverfolyamat az elmúlt pár évben jelent&#337;sen átalakult, fejl&#337;dött. Ennek eredménye, hogy szabványos folyamatokat még nem sikerült kialakítani.</p></li><li class="listitem"><p>A nagy szoftverprojektek gyakran több &#8222;különálló&#8221; projekt: a nagy szoftverprojek­tek gyakran különböznek minden más korábbi projektt&#337;l, ezért több bizonytalanságot rejtenek magunkban, melyekre nehéz el&#337;re felkészülni. Ráadásul a gyors technológiai váltások a számítástechnika és kommunikáció területén a korábbi tapasztalatokat el­avulttá teszik.</p></li></ol></div><p>Nem meglepetés tehát, hogy számos szoftverpro­jekt késik, túllépi a költségvetést és a határid&#337;ket. A szoftverrendszerek gyakran újak és technikailag innovatívak. Az innovatív tervez&#337;i projektek szintén gyakran küszködnek határid&#337;kb&#337;l fakadó problémákkal. Látva az érintett nehézségeket, talán figyelemre méltó, hogy léteznek projektek, melyek a megadott id&#337;n és költségvetésen belül elkészülnek.</p><div class="sect2" title="15.2.1. 15.2.1 A projektek tervezése"><div class="titlepage"><div><div><h3 class="title"><a name="d0e6302"></a>15.2.1. 15.2.1 A projektek tervezése</h3></div></div></div><p>Egy projekt sikeres el&#337;rehaladása nagymértékben függ a folyamatok el&#337;re való megtervezését&#337;l. Nagyon fontos, hogy a vezet&#337;k el&#337;re átgondolják az egyes fejlesztési fázisokat, a fázisok buktatóit, a felmerül&#337; problémákat. Fel kell készülni és hozzávet&#337;legesen megoldásokat kell el&#337;készíteni az adott problémákra. Mindezen feladatok a projektvezet&#337; személyére hárulnak, aki ezekre reagálva gondos tervezés útján elkészíti a projekt tervét. Ezt a tervet úgy érdemes használ­ni, mint a projekt egyik irányvonalát. Ennek a kezdeti tervnek a lehet&#337; legjobb tervnek kell lennie, amely a rendelkezésre álló információkból adható. Termé­szetesen ez fokozatosan továbbfejl&#337;dik, ahogy a projekt el&#337;rehalad és több, jobb információ válik elérhet&#337;vé.</p><p>A menedzsernek különböz&#337; terveket kell felvázolnia. Ezek rövid összefoglalása a következ&#337;:</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>Min&#337;ségi terv: meghatározza azokat a min&#337;ségi eljárásokat és szabványokat, ame­lyeket a projektben használni kell.</p></li><li class="listitem"><p>Validációs terv: meghatározza a megközelítési módot, az er&#337;forrásokat és az ütem­terveket, melyeket a rendszer validációjához használni kell.</p></li><li class="listitem"><p>Konfigurációkezelési terv: meghatározza a konfigurációkezelési eljárásokat és szerkezeteket, amelyeket alkalmazni kell.</p></li><li class="listitem"><p>Karbantartási terv: el&#337;re megadja a rendszer karbantartási követelményeit, a karbantar­tási költségeket és a szükséges er&#337;feszítéseket.</p></li><li class="listitem"><p>Munkaer&#337;-fejlesztési terv: meghatározza, hogyan kell a projektcsapat tagjainak szaktudását és tapasztalatait fejleszteni.</p></li></ol></div><p>A tervezés iteratív folyamat. A projekt el&#337;rehaladása során újabb és újabb információk látnak napvilágot a fejlesztéssel kapcsolatban. Amin ezen információi elérhet&#337;vé válnak, a tervet rendszeresen át kell vizsgálni és szükség esetén módosítani azt.</p><p>A tervezési folyamat a projektet meghatározó megszorítások összegzésével indul (megkívánt szállítási határid&#337;, rendelkezésre álló munkaer&#337;, teljes költség­vetés stb). Ezekkel a projekt olyan paramétereinek becslésével együtt kell foglal­kozni, mint például annak szerkezete, mérete, funkcióinak eloszlása. Az el&#337;re­haladás mérföldköveit és a részeredményeket csak ezután határozzuk meg. Ezek után a folyamat belép egy ciklusba. A projekt ütemtervét fel kell vázolni és az ütemterv által meghatározott tevékenységeket el kell indítani, vagy engedélyez­ni kell azok folytatását. Bizonyos id&#337; után (általában 2-3 hét) a folyamat átvizsgá­landó és az eltérések feljegyzend&#337;k. Mivel a projekt paramétereinek becslése csak hozzávet&#337;leges, a tervnek mindig szüksége van a módosításokra.</p><p>A projektmenedzsereknek felül kell vizsgálniuk a projekttel kapcsolatos fel­tételezéseiket, ahogy egyre több információ áll rendelkezésükre. Újra kell ter­vezniük a projekt ütemtervét. Ha a projekt késik, újra kell tárgyalniuk a meg­rendel&#337;vel a projekt megszorításait és a leszállítandó részeket. Ha ez sikertelen és az ütemterv nem tartható, technikai felülvizsgálatra van szükség. Ennek a fe­lülvizsgálatnak az a célja, hogy valamilyen alternatív megközelítési módot talál­jon a fejlesztéshez, amely a projekt megszorításaiba még belefér és megfelel az ütemtervnek.</p><div class="sect3" title="15.2.1.1. 15.2.2 A projektterv"><div class="titlepage"><div><div><h4 class="title"><a name="d0e6331"></a>15.2.1.1. 15.2.2 A projektterv</h4></div></div></div><p>A projektterv lényegében egy induló dokumentum, megpróbálja összefogni a projekthez szükséges minden összetev&#337;t. Ilyen például a rendelkezésre álló er&#337;források, a munka felosztása és a munka végrehajtásának ütemterve. A részletezettségi szintje mindig az adott fejlesztési projekthez igazodik és a szervezetek típusától függ&#337;en változik. Ennek ellenére mindig érdemes egy olyan ajánlást tenni, amely egy javasolt mintaként szolgál a dokumentum készítése során.</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>Bevezetés. Legf&#337;bb célja a projekt céljainak tömör leírása, és azon megszorítások felsorolása (például költségvetés, id&#337; stb.), amelyek befolyásolják a projekt menedzselését.</p></li><li class="listitem"><p>Projektszervezet. A projektben résztvev&#337; személyeket és szerepüket tisztázza.</p></li><li class="listitem"><p>Kockázatelemzés. A projekttel szemben felmerül&#337; lehetséges kockázatai tényez&#337;ket tárgyalja. A bekövetkezésük valószín&#369;ségét és a kockázat csökkentésének ajánlott stratégiáját. </p></li><li class="listitem"><p>Hardver- és szoftverer&#337;forrás-követelmények. A fejlesztéshez szükséges hardver és szoftver komponensek összegy&#369;jtése. Vásárlás esetén meg kell becsülni az árakat és a beszerzés határidejét.</p></li><li class="listitem"><p>Projekt költségterv. A szoftver megvalósításának követelményei és a rendelkezésre álló er&#337;források alapján a projekt megvalósításának pénzügyi realizációját fekteti le.</p></li><li class="listitem"><p>Munka felosztása. Megadja a projekt tevékenységekre történ&#337; felosztását, és azonosítja a tevékenységekhez kapcsolódó mérföldköveket és részeredmé­nyeket. </p></li><li class="listitem"><p>Projekt ütemterve. Meghatározza a tevékenységek közötti függ&#337;ségeket, meg­becsüli a mérföldkövek eléréséhez szükséges id&#337;ket, és javaslatot tesz a tevé­kenységekhez rendelend&#337; emberekre.</p></li><li class="listitem"><p>Figyelési és jelentéskészítési mechanizmusok. Meghatározza a menedzser által el&#337;állítandó jelentéseket, azok el&#337;állításának idejét és a használandó projekt­figyelési, monitorozási technikát.</p></li></ol></div><p>A projekttervet rendszeresen át kell vizsgálni a projekt ideje alatt. Az olyan részek, mint például a projekt ütemezése, rendszeresen meg fognak változni, míg egyéb részek pedig stabilan megmaradnak. Olyan dokumentumszervezést érde­mes használni, mely lehet&#337;vé teszi az egyszer&#369; cseréket, b&#337;vítéseket a dokumen­tumban.</p><p></p></div><div class="sect3" title="15.2.1.2. 15.2.3 Mérföldkövek"><div class="titlepage"><div><div><h4 class="title"><a name="d0e6364"></a>15.2.1.2. 15.2.3 Mérföldkövek</h4></div></div></div><p>A menedzsereknek folyamatosan információra van szükségük a projekt el&#337;rehaladásával kapcsolatban. Mivel a szoftver kézzel nem fogható dolog, és az információk csak dokumentum formájában biztosíthatók, szükség van olyan ellen&#337;rz&#337; pontokra, melyek újragondolási, értékelési lehet&#337;séget biztosítanak a fejlesztés során. Ezeket a pontokat mérföldköveknek nevezik. </p><p>Amikor egy projektet tervezünk, számos mérföldkövet kell el&#337;re meghatároznunk, ahol minden egyes mérföldk&#337; egy szoftverfolyamat-tevékenység végpontja. Célszer&#369; a mérföldkövek elérésekor jelentést készíteni, amely bemutatható a vezetésnek. Ezen jelentések nem szükségszer&#369;en nagy dokumentumok. Akár a projekt tevékenységei teljesítésének egy­szer&#369; rövid leírása is lehet. A mérföldköveket úgy érdemes reprezentálni, mint a projekt logikai szakaszainak végeit. </p><p></p></div></div><div class="sect2" title="15.2.2. 15.2.4 A projekt ütemezése"><div class="titlepage"><div><div><h3 class="title"><a name="d0e6372"></a>15.2.2. 15.2.4 A projekt ütemezése</h3></div></div></div><p>A projekt ütemezése a projektmenedzserek kit&#369;ntetett feladata. A menedzserek megbecsülik a tevékenységek elvégzéséhez szükséges id&#337;t és er&#337;forrásokat, és egy összefügg&#337; szekvenciába rendezik &#337;ket. Hacsak a projekt ütemezése nem egyezik meg teljes mértékben az el&#337;z&#337; projekttel, annak becslései bizonytalan alapjai az új projekt ütemezésének. </p><p>Ha a projekt technikailag fejlettebb, a kezdeti becslések majdnem mindig optimistábbak lesznek, még akkor is, ha a menedzserek megpróbálnak minden es­het&#337;séget figyelembe venni. Az ütemterveket folyamatosan frissíteni kell, ahogy egyre több információ áll rendelkezésünkre.</p><p></p><p></p><div class="figure"><a name="d0e6381"></a><p class="title"><b>15.3. ábra - A projekt ütemezési folyamata</b></p><div class="figure-contents"><div align="center"><img src="images/image83.png" align="middle" alt="A projekt ütemezési folyamata"></div></div></div><br class="figure-break"><p>A projekt ütemezése magában foglalja a projekt teljes munkájának különálló tevékenységekre bontását és a tevékenységek elvégzéséhez szükséges id&#337; megítélését is. Általában ezek közül a tevékenységek közül néhány párhu­zamosan is elvégezhet&#337;. A projekt ütemez&#337;inek kell koordinálniuk ezeket a párhuzamos tevékenységeket, és úgy megszervezniük a munkát, hogy a munkaer&#337; kihasználtsága optimális legyen. El kell kerülniük az olyan szituációkat, ahol a teljes projekt azért csúszik, mert egy kritikus feladat még nincs befejezve.</p><p>A projekttevékenységek normális esetben legalább egy hétig tartanak. A finomabb felosztás azt jelenti, hogy aránytalanul sok id&#337;t kell szánni a becslésre és a felülvizsgálatra. Szintén hasznos, ha fels&#337; id&#337;korlátot szabunk azokra a tevékenységekre, amelyek 8-10 hétig tartanak. Ha ezt túllépik, akkor ajánlatos a tervet és az ütemezést részekre bontani.</p><p>Az ütemtervek megállapításakor a menedzsereknek nem ajánlatos azt feltételezniük, hogy a projekt minden egyes szakasza problémamentes lesz. A projekten dolgozó egyének megbetegedhetnek vagy eltávozhatnak, a hardverek meghibásodhatnak, vagy az elengedhetetlen szoftvereket és hardvereket késve szállítják. Ha a projekt még új és technikailag is újszer&#369;, bizonyos részeir&#337;l kiderülhetnek, hogy nehezebbek és hosszabb ideig tartanak, mint azt gondoltuk.</p><p>A projekt ütemtervét legtöbbször diagramok és a tevékenységhálók, grafikus jelölések, halmazaként reprezentálják, amelyek a munka felosztását, a tevékenységek függ&#337;ségeit, a munkaer&#337;k elhe­lyezkedését stb. szemléltetik. A diagramok el&#337;állításának automatizálására gyakran használnak szoftvermenedzselési eszközö­ket, mint például a Microsoft Projectet.</p><p></p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="ch15.html">El&#337;z&#337;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="ch15.html">Fel</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="ch15s03.html">Következ&#337;</a></td></tr><tr><td width="40%" align="left" valign="top">15. fejezet - További fejlesztési tevékenységek áttekintése&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Tartalom</a></td><td width="40%" align="right" valign="top">&nbsp;15.3. 
      
            15.3 Konfigurációkezelés</td></tr></table></div></body>
<!-- Mirrored from gyires.inf.unideb.hu/KMITT/c02/ch15s02.html by HTTrack Website Copier/3.x [XR&CO'2014], Fri, 27 Jan 2023 20:34:06 GMT -->
</html>