<html>
<!-- Mirrored from gyires.inf.unideb.hu/KMITT/c02/ch16s02.html by HTTrack Website Copier/3.x [XR&CO'2014], Fri, 27 Jan 2023 20:34:06 GMT -->
<head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>16.2. Követelmények felderítése</title><link rel="stylesheet" href="style.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.75.2"><link rel="home" href="index.html" title="Szoftverfejlesztés"><link rel="up" href="ch16.html" title="16. fejezet - Esettanulmány"><link rel="prev" href="ch16.html" title="16. fejezet - Esettanulmány"><link rel="next" href="ch16s03.html" title="16.3. A rendszer elemeinek, struktúrájának azonosítása"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">16.2. Követelmények felderítése</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch16.html">El&#337;z&#337;</a>&nbsp;</td><th width="60%" align="center">16. fejezet - Esettanulmány</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="ch16s03.html">Következ&#337;</a></td></tr></table><hr></div><div class="sect1" title="16.2. Követelmények felderítése"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e6496"></a>16.2. Követelmények felderítése</h2></div></div></div><p>Minden projekt egy ötlettel / f&#337; igénnyel kezd&#337;dik. Ebben az esetben ez a
                    következ&#337; volt: Kellene egy olyan rendszer szerkeszt&#337; a VIRCA rendszerünkhöz,</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>amely a rendszerünk OGRE 3D virtuális terében is
                                használható,</p></li><li class="listitem"><p>támogatja az Openrtm-aist rendszert (hiszen a mi rendszerünk azon
                                alapszik),</p></li><li class="listitem"><p>támogatja továbbá az általunk korábban elkészített
                                kiterjesztést.</p></li></ul></div><p> Nevezzük ezeket f&#337; követelményeknek. Ezt már most érezni lehet,
                    hogy ezek vizsgálata újabb követelményeket fognak felvetni. Ezeket sorra
                    megvizsgáltuk, majd pontosítottuk, részleteztük. Nézzük ezeket sorban! </p><p>
            <span class="bold"><strong>OGRE 3D virtuális terében használható. </strong></span>Az
                    OGRE C++-ban implementált SDK, amit használhatunk 3 dimenziós modellek
                    létrehozására mozgatására. Egyik lehet&#337;ség az volna, hogy mi felépítünk egy 3
                    dimenziós menüt, és szerkeszt&#337; felületet. Az Openrtm-t Japánban fejlesztették ki
                    és ott sok helyen használják. Ha OGRE alatt írjuk meg, akkor a menürendszer
                    változása miatt folyamatosan újabb és újabb verziót kell fordítanunk és
                    letölteni a felhasználóknak. Ez nagy függ&#337;séget jelentett volna. Fejlesztés
                    során törekedni kell az általános megoldásokra, a könnyen frissen tartható
                    rendszer komponensekre. Szerencsére akkoriban adták ki a Chrome böngész&#337;
                    memóriába dolgozó verzióját, amit rögtön implementáltak OGRE alá Berkelium
                    néven. A böngész&#337;ben m&#369;köd&#337; szerkeszt&#337; lényegesen leegyszer&#369;síti a fejlesztés
                    menetét és az el&#337;bb említett problémákra is megoldást kínál. (A felhasználó
                    minden használatkor a legfrissebb verziót használja.). Els&#337; fontos döntésünk
                    tehát, hogy egy webalkalmazást (vagy legalábbis böngész&#337;ben m&#369;köd&#337;) készítünk,
                    így a felhasználók köre b&#337;vülhet, hiszen olyanok is használhatják, akik az alap
                    Openrtm rendszert használják. Mivel ez egy grafikus szerkeszt&#337;, ezért valamilyen
                    kliens oldali technológiát kellett használnunk. Erre három lehet&#337;ség kínálkozik: </p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>Java FX</p></li><li class="listitem"><p>Flash/Flex</p></li><li class="listitem"><p>Silverlight</p></li></ul></div><p> A Microsoft által fejlesztett Silverligth technológiát azonnal
                    elvetettük, mert nem létezik Linux és Mac OS rendszerek alá lejátszó plugin a
                    böngész&#337;k alá. A Java FX és Flash támogatottság elég széleskör&#369;, ezért azok
                    teljesítményét, er&#337;forrás igényét, programozhatóságát, használhatóságát
                    vizsgáltuk meg. Sajnos a Berkelium alatt nem m&#369;ködött a Java FX lejátszó, így az
                    akkori körülmények miatt maradt a flash. (Az összehasonlítás egyik fontos
                    szempontja a minimális munka befektetése. Ezen okból a Java FX jobb lett volna,
                    hiszen ha a szerver oldal jsp-ben íródik, akkor számos osztály közös lehetett
                    volna.) Mivel a Flash rendszerben nem létezik CORBA és ICE könyvtár, így csak
                    vékony kliensr&#337;l beszélhetünk, azaz a kliens oldalon csak a komponensek és azok
                    kapcsolata jelenik meg, a tényleges aktiválás összekötés a szerver oldali logika
                    feladata. </p><p>
            <span class="bold"><strong>Támogatja az Openrtm-aist rendszert.</strong></span> Nyilván
                    ha használni, csatlakozni, vezérelni szeretnénk egy rendszert, akkor ismernünk
                    kell annak minden részletét. A rendszer felépítését és m&#369;ködését a Robot
                    Technology Component (RTC) specifikáció rögzíti, amely letölthet&#337; az OMG
                    weboldaláról. Tulajdonképpen minden olyan funkciót támogatnia kell, mint amit az
                    alap rendszer szerkeszt&#337;je támogat. Ezt viszonylag könny&#369; feltérképezni, hiszen
                    a gyári szerkeszt&#337; letölthet&#337; és kipróbálható. Jellegében is hasonlítania kell
                    az eredetihez, melyet a következ&#337; ábra mutat: </p><div class="figure"><a name="rtcse_kepernyo"></a><p class="title"><b>16.1. ábra - Az openrtm-aist rtcse rendszer szerkeszt&#337;jének képerny&#337;je</b></p><div class="figure-contents"><div align="center"><a name="graphic_4f6ea8cc-9519-4725-bd85-41afb82b9027"></a><img src="images/fig6rtsystemeditorview_en.png" align="middle" alt="Az openrtm-aist rtcse rendszer szerkeszt&#337;jének képerny&#337;je"></div></div></div><p><br class="figure-break"> Az ábra fels&#337; részén látható a f&#337; ablak, amiben balra az elérhet&#337;
                    komponensek, középen a szerkeszt&#337; terület, balra pedig a tulajdonság ablak
                    látható (tartalma a kiválasztott elem függvénye). Törekednünk kell arra, hogy a
                    fontos funkciókat implementáljuk el&#337;ször (s&#337;t ezen belül a meghatározókat és
                    amelyik kevés ráfordítást igényel). A szerkeszt&#337; funkciói a következ&#337;k: </p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>komponensek listázása (kapcsolódás a CORBA név
                                szolgáltatóhoz),</p></li><li class="listitem"><p>komponens adatainak a megjelenítése (portjainak elhelyezése a
                                komponens körül),</p></li><li class="listitem"><p>komponensek állapotának jelzése,</p></li><li class="listitem"><p>komponensek vezérlése (aktivizálás, resetelés),</p></li><li class="listitem"><p>portok összekötése (paraméterek megadása),</p></li></ul></div><p>
         </p><p>
            <span class="bold"><strong>Támogatja az általunk korábban elkészített kiterjesztést.</strong></span> Kifejlesztett kiterjesztésünknek egyik nagy
                    momentuma az ICE technológia támogatása lett. Az alap rendszerben használható
                    volt egy </p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>adatport (beépített típusok továbbítására és fogadására)</p></li><li class="listitem"><p>szervizport CORBA alapú(funkcionalitás, metódus távoli
                                hívására)</p></li></ul></div><p> A létez&#337; CORBA szerviz port használata (CORBA interfészek,
                    osztályok készítése) nehézkes és nagy gyakorlatot igényel. Ezért fejlesztettük
                    ki az ICE szerviz portot, amelyet sokkal egyszer&#369;bb használni és megérteni.
                    Másik nagy újdonság, hogy egy fogyasztó típusú szerviz porthoz (ICE) több
                    szolgáltató port is kapcsolódhat, ami a VIRCA rendszerben szükséges is. Ezeket a
                    kiterjesztéseket azonban a hivatalos szerkeszt&#337; nem érti, ezért kell beépíteni
                    az új szerkeszt&#337;be. </p><div class="sect2" title="16.2.1. Funkcionális követelmények felderítése"><div class="titlepage"><div><div><h3 class="title"><a name="d0e6568"></a>16.2.1. Funkcionális követelmények felderítése</h3></div></div></div><p> Az fejlesztés következ&#337; lépése a funkcionális követelmények feltárása,
                        erre remek módszer az UML használati eset diagramjának elkészítése. Az
                        ábráról gyorsan és egyértelm&#369;en leolvashatóak a kapcsolatok, azonban
                        szöveges leírás szükséges a modell elemek leírására. Egyes UML szerkeszt&#337;k a
                        diagramok és a modell alapján képesek dokumentációt generálni, ami igen
                        hasznos, sok munkát takarít meg. A következ&#337; ábrán láthatjuk a rendszer
                        használati eseteit: </p><div class="figure"><a name="hasznalatiE"></a><p class="title"><b>16.2. ábra - A szerkeszt&#337; használati esetei</b></p><div class="figure-contents"><div align="center"><img src="images/hasznalati_esetek.png" align="middle" alt="A szerkeszt&#337; használati esetei"></div></div></div><p><br class="figure-break">Ennek a létrehozása több lépésben szokott elkészülni, az nem baj,
                        ha els&#337;re nem jut eszünkbe minden funkció ( a módszerek is csak ajánlások
                        tesznek mikor legyen kész a teljes funkciólista bizonyos része). A diagram
                        pont arra jó, hogy a megrendel&#337;, vagy kollégánk a diagram alapján megérti
                        elképzelésünket és ki tudja egészíteni a listánkat. A diagram egyszer&#369;sége
                        miatt a megrendel&#337; is tudja használni azt. A dokumentációnak egységesnek kell
                        lennie minden azonos típusú elemre. A használati esetekr&#337;l tudnunk kell,
                        hogy mennyire fontos, milyen el&#337;feltételei, utóhatásai vannak. Érdemes a
                        használati eseteket összefoglalni, azaz definiálni a teljes listát, amit a
                        következ&#337; ábra foglal össze:</p><div class="table"><a name="d0e6578"></a><p class="title"><b>16.1. táblázat - Használati eset diagram elemeinek összefoglaló táblázata</b></p><div class="table-contents"><table summary="Használati eset diagram elemeinek összefoglaló táblázata" style="border: none;"><colgroup><col><col><col></colgroup><thead><tr><th style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">Rövid név</th><th style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">Megnevezés</th><th style="border-bottom: 0.5pt solid ; ">Dokumentáció</th></tr></thead><tbody><tr><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">A1</td><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; "> Kutató</td><td style="border-bottom: 0.5pt solid ; ">Személyek egy csoportja, akik grafikus felületen használják a rendszert. Nincs programozói ismeretük, azaz nem biztos, hogy &#337;k fejlesztették ki a komponenst.</td></tr><tr><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">HE1</td><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">Elérhet&#337; komponensek lekérdezése a CORBA nameserver-t&#337;l</td><td style="border-bottom: 0.5pt solid ; ">A szerkeszt&#337;nek fa struktúrában meg kell jelenítenie az elérhet&#337; komponenseket. Minden komponens regisztrálja magát egy corba name szerveren. A frissítés automatikus is és a felhasználó kérésére explicit is végre kell hajtani. </td></tr><tr><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">HE2</td><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">Komponens információk lekérdezése</td><td style="border-bottom: 0.5pt solid ; ">A felhasználó lekérdezheti a komponensek különböz&#337; paramétereit: <div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>tulajdonságait (készít&#337;, típus,
                                                  implementációs nyelv)</p></li><li class="listitem"><p>futási környezet paramétereit</p></li><li class="listitem"><p>státuszát</p></li></ul></div>
                           </td></tr><tr><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">HE3</td><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">Komponens beillesztése a robot rendszerbe</td><td style="border-bottom: 0.5pt solid ; ">A felhasználó grafikus felületen keresztül beilleszt egy komponenst a szerkeszt&#337; területre. A beillesztett komponensek f&#337;bb paramétereinek már lent kell lennie, pl.: Név, készít&#337;, portok nevei típusai, ...</td></tr><tr><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">HE4</td><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">Port csatlakoztatása egy másik porthoz</td><td style="border-bottom: 0.5pt solid ; ">Komponensek közötti kapcsolatot a rendszerben azok portjaival lehet létrehozni. Az alap rendszer nem minden esetben teszi lehet&#337;vé a több-több kapcsolatot, s&#337;t sok esetben a gyári szerkeszt&#337; grafikája is szétesik, de ez a szerkeszt&#337; támogatja azt.</td></tr><tr><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">HE5</td><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">Komponens vezérlése</td><td style="border-bottom: 0.5pt solid ; ">Komponensek vezérlése a kliensb&#337;l elengedhetetlen. Aktivizálás / deaktivizálás, vagy reszetelés. </td></tr><tr><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">HE6</td><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">Adatport kapcsolat paramétereinek beállítása</td><td style="border-bottom: 0.5pt solid ; ">Adatportok esetén a kapcsolat profil megadása dönt&#337;en befolyásolja az adat mozgását, ezért elengedhetetlen ezen funkció implementálása. </td></tr><tr><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">HE7</td><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">Felhasználói rendszer mentése lokálisan</td><td style="border-bottom: 0.5pt solid ; ">A felhasználó munkáját lementheti lokálisan. Ilyenkor a homokzsákban futó flash alkalmazás kell, hogy hozzáférjen a mentett rendszerhez. Legyen lehet&#337;ség egy létez&#337; mentett rendszer felülírására. </td></tr><tr><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">HE8</td><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">Felhasználói rendszer betöltése lokális gépr&#337;l</td><td style="border-bottom: 0.5pt solid ; ">A felhasználó munkáját betöltheti lokálisan. Ilyenkor a homokzsákban futó flash alkalmazás kell, hogy hozzáférjen a mentett rendszerhez. Legyen lehet&#337;ség a betöltés után ellen&#337;rizni a komponensek elérhet&#337;ségét. </td></tr><tr><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">HE9</td><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">Felhasználói rendszer mentése központi helyre</td><td style="border-bottom: 0.5pt solid ; ">A felhasználó munkáját lementheti központi helyre. Ilyenkor a homokzsákban futó flash alkalmazás kell, hogy hozzáférjen a mentett rendszerhez. Legyen lehet&#337;ség egy létez&#337; mentett rendszer felülírására. </td></tr><tr><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">HE10</td><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">Felhasználói rendszer betöltése központi helyr&#337;l</td><td style="border-bottom: 0.5pt solid ; ">A felhasználó munkáját betöltheti központi helyr&#337;l. Ilyenkor a homokzsákban futó flash alkalmazás kell, hogy hozzáférjen a mentett rendszerhez. Legyen lehet&#337;ség a betöltés után ellen&#337;rizni a komponensek elérhet&#337;ségét. </td></tr><tr><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">HE11</td><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; "> Adatport csatlakoztatása másikhoz</td><td style="border-bottom: 0.5pt solid ; ">Komponensek alapvet&#337; kommunikációjának eszköze az adatport. Itt el&#337;re definiált típusú információk mozognak. A kommunikáció egyirányú. </td></tr><tr><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">HE12</td><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">Szervizport összekapcsolása</td><td style="border-bottom: 0.5pt solid ; ">Az openrtm-aist rendszerben a komponens egy fekete doboz. Ha valamely másik komponens szeretné használni szolgáltatásait, akkor azt csak el&#337;re definiált interfészeken keresztül teheti. Ennek egyetlen módja a szerviz portok definiálása. Ha egy komponens fogyasztani akarja másik komponens által nyújtott szolgáltatást, akkor össze kell kötni azok szerviz portjait. </td></tr><tr><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">HE13</td><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">Corba szerviz portok összekapcsolása</td><td style="border-bottom: 0.5pt solid ; ">Az openrtm-aist rendszer tartalmaz CORBA szerviz portokat. Ennek támogatása elengedhetetlen. </td></tr><tr><td style="border-right: 0.5pt solid ; ">HE14</td><td style="border-right: 0.5pt solid ; ">Ice szerviz portok összekapcsolása</td><td style="">A SZTAKI által kifejlesztett új szerviz típus az ICE szerviz port. Ennek támogatása fontos feladat.</td></tr></tbody></table></div></div><p><br class="table-break"> Nézzünk meg példaként egy két használati eset részletes leírását:
                            </p><div class="table"><a name="d0e6711"></a><p class="title"><b>16.2. táblázat - "Elérhet&#337; komponensek lekérdezése a CORBA nameservert&#337;l" használati eset részletei</b></p><div class="table-contents"><table summary="&#34;Elérhet&#337; komponensek lekérdezése a CORBA nameservert&#337;l&#34; használati eset részletei" style="border: none;"><colgroup><col><col></colgroup><thead><tr><th style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">Megnevezés</th><th style="border-bottom: 0.5pt solid ; ">Érték</th></tr></thead><tbody><tr><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">Szint</td><td style="border-bottom: 0.5pt solid ; ">Felhasználó</td></tr><tr><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">Bonyolultság </td><td style="border-bottom: 0.5pt solid ; ">Alacsony</td></tr><tr><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">Prioritás</td><td style="border-bottom: 0.5pt solid ; ">Magas</td></tr><tr><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">El&#337;feltételek</td><td style="border-bottom: 0.5pt solid ; ">Futó CORBA name server, futó alkalmazás szerver.</td></tr><tr><td style="border-right: 0.5pt solid ; ">Utóhatások</td><td style="">Az elérhet&#337; komponensek eltárolódnak a modellben, a nézetben a felhasználó láthatja a komponenseket. </td></tr></tbody></table></div></div><p><br class="table-break">
                        
               </p><div class="table"><a name="d0e6750"></a><p class="title"><b>16.3. táblázat - "Port csatlakoztatása egy másik porthoz" használati eset részletei</b></p><div class="table-contents"><table summary="&#34;Port csatlakoztatása egy másik porthoz&#34; használati eset részletei" style="border: none;"><colgroup><col><col></colgroup><thead><tr><th style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">Megnevezés</th><th style="border-bottom: 0.5pt solid ; ">Érték</th></tr></thead><tbody><tr><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">Szint</td><td style="border-bottom: 0.5pt solid ; ">Felhasználó</td></tr><tr><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">Bonyolultság </td><td style="border-bottom: 0.5pt solid ; ">Közepes</td></tr><tr><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">Prioritás</td><td style="border-bottom: 0.5pt solid ; ">Magas</td></tr><tr><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">El&#337;feltételek</td><td style="border-bottom: 0.5pt solid ; ">
                      
                              <div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>A komponens portjának már ismertnek kell
                                                  lennie: típus, név (azaz már el&#337;z&#337;leg le kell
                                                  kérdezni a komponenst&#337;l) .</p></li><li class="listitem"><p>Azonos típusúak kell legyenek.</p></li></ol></div>
                    
                           </td></tr><tr><td style="border-right: 0.5pt solid ; ">Utóhatások</td><td style="">A komponens adatokat fogadhat/küldhet vagy szolgáltatást használhat/nyújthat. </td></tr></tbody></table></div></div><p><br class="table-break"> Ha több aktor van, akkor érdemes szerepeltetni azt is egy plusz
                        oszlopban. Szerepelhet még az alternatív m&#369;ködés is.</p></div><div class="sect2" title="16.2.2. Nem funkcionális követelmények felderítése"><div class="titlepage"><div><div><h3 class="title"><a name="sect2_0858942f-6556-4abb-ad0e-9df3c8156862"></a>16.2.2. Nem funkcionális követelmények felderítése</h3></div></div></div><p>Ehhez a lépéshez az UML nem ad segítséget, a legtöbb módszer szöveges
                        dokumentum létrehozását javasolja. A SysML azonban lehet&#337;ség ad követelmény
                        diagram formájában. Ez a diagram tartalmazhatja a használati eseteket is,
                        azonban vigyázzunk arra, hogy ha változtatjuk, akkor mind a két helyen
                        változtassuk. Nagy el&#337;nye a diagramnak, hogy a követelmények közötti
                        tartalmazás, pontosítás kapcsolatokat is ábrázolja, s&#337;t a követelményeket
                        ellen&#337;rz&#337; teszt eseteket! Itt is a fontos követelményekkel , követelmény
                        kategóriákkal kezdünk, majd törekedünk a teljességre. </p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="ch16.html">El&#337;z&#337;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="ch16.html">Fel</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="ch16s03.html">Következ&#337;</a></td></tr><tr><td width="40%" align="left" valign="top">16. fejezet - Esettanulmány&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Tartalom</a></td><td width="40%" align="right" valign="top">&nbsp;16.3. A rendszer elemeinek, struktúrájának azonosítása</td></tr></table></div></body>
<!-- Mirrored from gyires.inf.unideb.hu/KMITT/c02/ch16s02.html by HTTrack Website Copier/3.x [XR&CO'2014], Fri, 27 Jan 2023 20:34:06 GMT -->
</html>